Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTextAttributes.Frame Property
 The frame type of the dimension value text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.FrameTypes Frame { get; set; }
Public Property Frame As DimensionSetBaseAttributes.FrameTypes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.FrameTypes
See Also
Reference
DimensionSetBaseAttributes.DimensionTextAttributes Class
Tekla.Structures.Drawing Namespace